[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:13:43
         private readonly Queue<int> _availablesSeatNumber;
         private readonly string _id;
         public int NumberOfSeats { get; }
-        public int NumberOfSeatsBooked => NumberOfSeats  - _availablesSeatNumber.Count;
+        public int NumberOfSeatsBooked => NumberOfSeats  + _availablesSeatNumber.Count;
         private const decimal PercentOnlineBookingAuthorizeOnCoach = (decimal) 70.0;
         

[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:35:20
 
         public bool HasSeatAvailable(int nbSeatToBook)
         {
-            return PercentNumberOfSeatsBooked(nbSeatToBook) <= PercentOnlineBookingAuthorizeOnCoach;
+            return PercentNumberOfSeatsBooked(nbSeatToBook) < PercentOnlineBookingAuthorizeOnCoach;
         }
         

[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:35:20
 
         public bool HasSeatAvailable(int nbSeatToBook)
         {
-            return PercentNumberOfSeatsBooked(nbSeatToBook) <= PercentOnlineBookingAuthorizeOnCoach;
+            return PercentNumberOfSeatsBooked(nbSeatToBook) > PercentOnlineBookingAuthorizeOnCoach;
         }
         

[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:40:20
         
         public bool TotallyFull(int nbSeatToBook)
         {
-            return NumberOfSeatsBooked + nbSeatToBook > NumberOfSeats;
+            return NumberOfSeatsBooked + nbSeatToBook < NumberOfSeats;
         }
         

[Survived] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:40:20
         
         public bool TotallyFull(int nbSeatToBook)
         {
-            return NumberOfSeatsBooked + nbSeatToBook > NumberOfSeats;
+            return NumberOfSeatsBooked + nbSeatToBook >= NumberOfSeats;
         }
         

[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:45:20
         
         private decimal PercentNumberOfSeatsBooked(int nbSeat)
         {
-            return ((NumberOfSeatsBooked + nbSeat) / (decimal) NumberOfSeats) * 100;
+            return ((NumberOfSeatsBooked + nbSeat) / (decimal) NumberOfSeats) / 100;
         }
     }

[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:45:22
         
         private decimal PercentNumberOfSeatsBooked(int nbSeat)
         {
-            return ((NumberOfSeatsBooked + nbSeat) / (decimal) NumberOfSeats) * 100;
+            return ((NumberOfSeatsBooked - nbSeat) / (decimal) NumberOfSeats) * 100;
         }
     }
