[Killed] Binary expression mutation
KataTrainReservation.Domain/Seat.cs:26:20
         {
             Seat other = obj as Seat;
 
-            return this.Coach == other.Coach && this.SeatNumber == other.SeatNumber;
+            return this.Coach != other.Coach  && this.SeatNumber == other.SeatNumber;
         }
     }

[Killed] Binary expression mutation
KataTrainReservation.Domain/Seat.cs:26:49
         {
             Seat other = obj as Seat;
 
-            return this.Coach == other.Coach && this.SeatNumber == other.SeatNumber;
+            return this.Coach == other.Coach && this.SeatNumber != other.SeatNumber;
         }
     }
