[Killed] Binary expression mutation
KataTrainReservation.Domain/Train.cs:23:16
         
         public IEnumerable<Seat> BookSeat(int nbSeat)
         {
-            if(PercentNumberOfSeatsBooked(nbSeat) > PercentOnlineBookingAuthorizeOnTrain) 
+            if(PercentNumberOfSeatsBooked(nbSeat) < PercentOnlineBookingAuthorizeOnTrain) 
                 throw new ApplicationException("Cannot book more than 70% of the train");
 

[Killed] Binary expression mutation
KataTrainReservation.Domain/Train.cs:23:16
         
         public IEnumerable<Seat> BookSeat(int nbSeat)
         {
-            if(PercentNumberOfSeatsBooked(nbSeat) > PercentOnlineBookingAuthorizeOnTrain) 
+            if(PercentNumberOfSeatsBooked(nbSeat) >= PercentOnlineBookingAuthorizeOnTrain) 
                 throw new ApplicationException("Cannot book more than 70% of the train");
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
KataTrainReservation.Domain/Train.cs:31:98
 
         private Coach SelectAvailableCoach(int nbSeat)
         {
-            return Coaches.FirstOrDefault(c => c.HasSeatAvailable(nbSeat)) ?? Coaches.First(c => !c.TotallyFull(nbSeat));
+            return Coaches.FirstOrDefault(c => c.HasSeatAvailable(nbSeat)) ?? Coaches.First(c => c.TotallyFull(nbSeat));
         }
 

[Killed] Binary expression mutation
KataTrainReservation.Domain/Train.cs:38:22
         {
             decimal numberOfSeatsBooked = Coaches.Select(c => c.NumberOfSeatsBooked).Sum();
             decimal numberOfSeats = Coaches.Select(c => c.NumberOfSeats).Sum();
-            return ((numberOfSeatsBooked + nbSeat) / numberOfSeats) * 100;
+            return ((numberOfSeatsBooked - nbSeat) / numberOfSeats) * 100;
         }
     }

[Killed] Binary expression mutation
KataTrainReservation.Domain/Train.cs:38:21
         {
             decimal numberOfSeatsBooked = Coaches.Select(c => c.NumberOfSeatsBooked).Sum();
             decimal numberOfSeats = Coaches.Select(c => c.NumberOfSeats).Sum();
-            return ((numberOfSeatsBooked + nbSeat) / numberOfSeats) * 100;
+            return ((numberOfSeatsBooked + nbSeat) * numberOfSeats) * 100;
         }
     }
