[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:41:20
         
         public bool TotallyFull(int nbSeatToBook)
         {
-            return NumberOfSeatsBooked + nbSeatToBook > NumberOfSeats;
+            return NumberOfSeatsBooked - nbSeatToBook  > NumberOfSeats;
         }
         
