[Killed] Binary expression mutation
KataTrainReservation.Domain/Coach.cs:46:21
         
         private decimal PercentNumberOfSeatsBooked(int nbSeat)
         {
-            return ((NumberOfSeatsBooked + nbSeat) / (decimal) NumberOfSeats) * 100;
+            return ((NumberOfSeatsBooked + nbSeat) * (decimal) NumberOfSeats) * 100;
         }
     }
