[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
KataTrainReservation.Domain/Train.cs:33:103
         {
 
             var availableCoach = Coaches.FirstOrDefault(c => 
-                                           c.HasSeatAvailable(nbSeat)) ?? Coaches.FirstOrDefault(c => !c.TotallyFull(nbSeat)
+                                           c.HasSeatAvailable(nbSeat)) ?? Coaches.FirstOrDefault(c => c.TotallyFull(nbSeat)
+
                                        );
             

[Killed] Binary expression mutation
KataTrainReservation.Domain/Train.cs:36:16
                                            c.HasSeatAvailable(nbSeat)) ?? Coaches.FirstOrDefault(c => !c.TotallyFull(nbSeat)
                                        );
             
-            if(availableCoach == null) throw new ApplicationException("No coach has the enough seat ");
+            if(availableCoach != null) throw new ApplicationException("No coach has the enough seat ");
             return availableCoach;
         }
